//JOBNAME  JOB (ACCT1),'RICHARD DORIA'
//STEP1    EXEC PGM=DEVOPS
//STEPLIB  DD  DSN=SRC(DEVOPS),DISP=SHR
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  DUMMY
